Core/src/Documents/РасспределениеЗатратНаТовары/РасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасспределениеЗатратНаТовары</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасспределениеЗатратНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратТек</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаТек</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглТек</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаНов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюВТекущемМесяцеНов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиТек</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиПоСчетам</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто1</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто2</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто3</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКотроль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоваровНаСкладе</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себистоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>Срок использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийРасспределениеЗатратНаТовары/ВидыОперацийРасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасспределениеЗатратНаТовары</name>
  <enumValues>
    <name>НаТовары</name>
  </enumValues>
  <enumValues>
    <name>НаИмущество</name>
  </enumValues>
  <enumValues>
    <name>ПоПроектам</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>БезПроекта</name>
      <description>პროექტის გარეშე</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRy_ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyТипыПроектов</name>
    <type>
      <types>EnumRef.AzRyТипыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraProject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаправленияДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRytmpТаблицаКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/РасспределениеЗатратНаТовары/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	ФОУчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	
		Объект.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Объект.ДатаОкончания = КонецМесяца(ТекущаяДата());
		//Период
		Период.ДатаНачала = Объект.ДатаНачала;
		Период.ДатаОкончания = Объект.ДатаОкончания;
		
		Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары;
		
	Иначе
		
		Период.ДатаНачала = Объект.ДатаНачала;
		Период.ДатаОкончания = Объект.ДатаОкончания;
		
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.ДатаНачала); //+++ Дмгг
	
	ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
	
	ЭтоРаспределениеНаТовары = Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары;
	
	//ПодольскиАИ #УчетПроектов 15.12.2020 {
	ЭтоРаспределениеПоПроектам = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам"); 
	ПрошлыйВидОперации = Объект.ВидОперации;
	//ПодольскиАИ #УчетПроектов 15.12.2020 }
	
	ИнициализироватьКомпоновщикНастроек();
	УстановитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	//Было---
	//Элементы.ГруппаОстаткиОтваровНаСкладе.Видимость = ЭтоРаспределениеНаТовары;
	//Элементы.ГруппаИмущество.Видимость = НЕ ЭтоРаспределениеНаТовары;
	//Стало+++
	Элементы.ГруппаОстаткиОтваровНаСкладе.Видимость = ЭтоРаспределениеНаТовары ИЛИ ЭтоРаспределениеПоПроектам;
	Элементы.ГруппаИмущество.Видимость = НЕ ЭтоРаспределениеНаТовары И НЕ ЭтоРаспределениеПоПроектам;
	////
	
	Элементы.Подразделение.Видимость = ЭтоРаспределениеНаТовары;
	Элементы.ОстаткиПоСчетамСтруктурнаяЕдиница.Видимость = ЭтоРаспределениеНаТовары;
	Элементы.Проект.Видимость = ЭтоРаспределениеПоПроектам;
	Элементы.ОстаткиПоСчетамПроект.Видимость = ЭтоРаспределениеПоПроектам;
	
	Если ФОУчетПоПроектам Тогда
		Элементы.ВидОперации.РежимВыбораИзСписка = Истина;
		
		СписокОпераций = Новый Массив;
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары);
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество);
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам);
		
		Элементы.ВидОперации.СписокВыбора.ЗагрузитьЗначения(СписокОпераций);
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// ОстаткиТоваров
	НаборыДанныхОстаткиТоваров = Новый Структура;
	
	СКД_Остатки = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладе");
	//ПодольскийАИ #УчетПроектов 16.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СКД_Остатки = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладеПоПроекту");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 16.12.2020 }
	
	НастройкиОстатки = СКД_Остатки.НастройкиПоУмолчанию;
	
	АдресВоВременномХранилищеОстатки = ПоместитьВоВременноеХранилище(СКД_Остатки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилищеОстатки);
	КомпоновщикНастроекОстаткиТовары.Инициализировать(ИсточникНастроек);	
	КомпоновщикНастроекОстаткиТовары.ЗагрузитьНастройки(СКД_Остатки.НастройкиПоУмолчанию);
	
	// ОборотыСчетов
	НаборыДанныхОборотыСчетов = Новый Структура;
	
	СКД_Обороты = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетам");
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СКД_Обороты = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетамПроектов");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	НастройкиОбороты = СКД_Обороты.НастройкиПоУмолчанию;
	
	АдресВоВременномХранилищеОбороты = ПоместитьВоВременноеХранилище(СКД_Обороты, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилищеОбороты);
	КомпоновщикНастроекОборотыПоСчетам.Инициализировать(ИсточникНастроек);	
	КомпоновщикНастроекОборотыПоСчетам.ЗагрузитьНастройки(СКД_Обороты.НастройкиПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	Если НЕ Объект.Проведен Тогда 
		ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиПоТоварамНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	//Получаем схему из макета
		
	НаборыДанных = Новый Структура;
		
	СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладе");
	//ПодольскийАИ #УчетПроектов 16.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладеПоПроекту");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 16.12.2020 }
	
	Настройки = КомпоновщикНастроекОстаткиТовары.ПолучитьНастройки();//Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаДату", Объект.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	
	//ПодольскийАИ #УчетПроектов 22.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		ТаблицаПосчетам = Объект.ОстаткиПоСчетам.Выгрузить( , "Проект");
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокПроектов", ТаблицаПосчетам.ВыгрузитьКолонку("Проект"));
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 22.12.2020 }
	
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	ЕстьНоменклатураОтбора = ЛОЖЬ;
	МассивНоменклатур = Номенклатура.ВыгрузитьЗначения();
	ЕстьНоменклатураОтбора = МассивНоменклатур.Количество() > 0; 
	
	ЕстьСкладыОтбора = ЛОЖЬ;
	МассивСкладов = Склад.ВыгрузитьЗначения();
	ЕстьСкладыОтбора = МассивСкладов.Количество() > 0;
	
	Для Каждого ЭлемОтбора Из Настройки.Отбор.Элементы Цикл 
		
		Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда 
			Если ЕстьНоменклатураОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивНоменклатур;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница") Тогда 
			Если ЕстьСкладыОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивСкладов;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки, ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаИзСКД = ТаблицаИзСКДОстатки.Выгрузить();
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаИзСКД);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Объект.ОстаткиТоваровНаСкладе.Очистить();
	Для Каждого Строк Из ТаблицаИзСКД Цикл
		
		НовСтрокОстатокТоваров = Объект.ОстаткиТоваровНаСкладе.Добавить();
		
		НовСтрокОстатокТоваров.Отметка 				= Истина;
		НовСтрокОстатокТоваров.СтруктурнаяЕдиница 	= Строк.СтруктурнаяЕдиница;
		НовСтрокОстатокТоваров.Номенклатура 		= Строк.Номенклатура;
		НовСтрокОстатокТоваров.Характеристика 		= Строк.Характеристика;
		НовСтрокОстатокТоваров.Количество 			= Строк.Количество;
		НовСтрокОстатокТоваров.СуммаРасходов 		= 0;
		НовСтрокОстатокТоваров.Себистоимость 		= Строк.Себистоимость;
		
		//ПодольскийАИ #УчетПроектов 24.12.2020 {
		Если ЭтоРаспределениеПоПроектам Тогда
			НовСтрокОстатокТоваров.Проект	= Строк.Проект;
		КонецЕсли;
		//ПодольскийАИ #УчетПроектов 24.12.2020 }
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиПоТоварам(Команда)
	
	Если Объект.Проведен И ПредыдущаяКонечнаяДатаПериода < Период.ДатаОкончания Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		
		Ответ = Вопрос(НСтр("ru='Перед заполнением ""таблица остатков"" требуется распровести документ. Продолжить?';"
							+ " ka = 'შევსების შემდეგ ცხრილური ნაწილი ""მარაგები"" გასუფთავდება. გაგრძელდეს ?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			РаспровестиДокумент();
		КонецЕсли;
		
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Если Объект.ОстаткиТоваровНаСкладе.Количество() <> 0 Тогда 
		
		Ответ = Вопрос(НСтр("ru='Перед заполнением ""таблица остатков"" будет очищена. Продолжить?';"
		+ " ka = 'შევსების შემდეგ ცხრილური ნაწილი ""მარაგები"" გასუფთავდება. გაგრძელდეს ?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЗаполнитьОстаткиПоТоварамНаСервере();
		КонецЕсли;
		
	Иначе
		ЗаполнитьОстаткиПоТоварамНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура РаспровестиДокумент()

	Попытка
		
		ДокОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.РасспределениеЗатратНаТовары"));
		
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		ЗначениеВданныеФормы(ДокОбъект,Объект);
		
		ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
		
	Исключение
		
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиПоСчетамНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	//Получаем схему из макета
		
	НаборыДанных = Новый Структура;
	
	СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетам");
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетамПроектов");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	Настройки = КомпоновщикНастроекОборотыПоСчетам.ПолучитьНастройки();//Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", ?(ЗначениеЗаполнено(Период.ДатаНачала), Период.ДатаНачала, Дата('00010101')));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, Дата('39990101')));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	ЕстьСчетаОтбора = ЛОЖЬ;
	МассивСчетов = СчетаУчетаРегл.ВыгрузитьЗначения();
	ЕстьСчетаОтбора = МассивСчетов.Количество() > 0; 
	
	ЕстьПодразделениеОтбора = ЛОЖЬ;
	МассивПодразделений = Подразделение.ВыгрузитьЗначения();
	ЕстьПодразделениеОтбора = МассивПодразделений.Количество() > 0;
	
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	ЕстьПроектОтбора = ЛОЖЬ;
	МассивПроектов = Проект.ВыгрузитьЗначения();
	ЕстьПроектОтбора = МассивПроектов.Количество() > 0;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	Для Каждого ЭлемОтбора Из Настройки.Отбор.Элементы Цикл 
		
		//ПодольскийАИ #УчетПроектов 15.12.2020 {
		Если ЭтоРаспределениеПоПроектам Тогда
			Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект") Тогда 
				Если ЕстьПроектОтбора Тогда 
					ЭлемОтбора.Использование = Истина;
					ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					ЭлемОтбора.ПравоеЗначение = МассивПроектов;
				Иначе
					ЭлемОтбора.Использование = Ложь;
					ЭлемОтбора.ПравоеЗначение = Справочники.Проекты.ПустаяСсылка();
				КонецЕсли;
				Продолжить;
			КонецЕсли;
		//ПодольскийАИ #УчетПроектов 15.12.2020 }
		
		ИначеЕсли ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда 
			Если ЕстьПодразделениеОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивПодразделений;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СчетУчета") Тогда 
			Если ЕстьСчетаОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивСчетов;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки, ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаИзСКД = ТаблицаИзСКДОбороты.Выгрузить();
	ТаблицаИзСКД.Очистить();
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаИзСКД);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	объект.ОстаткиПоСчетам.Очистить();
	объект.ОстаткиТоваровНаСкладе.Очистить();
	Для Каждого Строк Из ТаблицаИзСКД Цикл
		
		НовСтрокОстатокТоваров = Объект.ОстаткиПоСчетам.Добавить();
		
		НовСтрокОстатокТоваров.СчетУчета			= Строк.СчетУчета;
		НовСтрокОстатокТоваров.Сумма				= Строк.Сумма;
		
		//ПодольскийАИ #учетПроектов 15.12.2020 {
		//Было---
		//НовСтрокОстатокТоваров.СтруктурнаяЕдиница	= Строк.Подразделение;
		//Стало+++
		Если ЭтоРаспределениеПоПроектам Тогда
			НовСтрокОстатокТоваров.Проект = Строк.Проект;
		Иначе
			НовСтрокОстатокТоваров.СтруктурнаяЕдиница	= Строк.Подразделение;
		КонецЕсли;
		//ПодольскийАИ #учетПроектов 15.12.2020 }
		
		НовСтрокОстатокТоваров.ВидСубконто1			= Строк.ВидСубконто1;
		НовСтрокОстатокТоваров.ВидСубконто2			= Строк.ВидСубконто2;
		НовСтрокОстатокТоваров.ВидСубконто3			= Строк.ВидСубконто3;
		НовСтрокОстатокТоваров.СуммаКотроль			= Строк.Сумма;
		
	КонецЦикла;
	
	//ПодольскийАИ #учетПроектов 18.12.2020 {
	//Было---
	//Если НЕ ЭтоРаспределениеНаТовары И ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда 
	//Стало+++
	Если НЕ ЭтоРаспределениеНаТовары И НЕ ЭтоРаспределениеПоПроектам И ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда 
	//ПодольскийАИ #учетПроектов 18.12.2020 }
		Объект.СтоимостьДляВычисленияАмортизацииНов = Объект.СтоимостьДляВычисленияАмортизацииТек + Объект.ОстаткиПоСчетам.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиПоСчетам(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Если Объект.ОстаткиПоСчетам.Количество() <> 0 Тогда 
		
		Ответ = Вопрос(НСтр("ru='Перед заполнением ""Таблица оборотов"" будет очищена. Продолжить?';"
		+ " ka = 'შევსების შემდეგ ცხრილური ნაწილი ""დანახარჯები"" გასუფთავდება. გაგრძელდეს ?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьОстаткиПоСчетамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоСуммеНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьСуммуСчетовНаТоварыПоСумме();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоСумме(Команда)
	
	Если Объект.ОстаткиПоСчетам.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ანგარიშები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Счета"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ОстаткиТоваровНаСкладе.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ნარჩენები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Остатки"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	РаспределитьПоСуммеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоКоличествуНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьСуммуСчетовНаТоварыПоКоличеству();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоКоличеству(Команда)
	
	Если Объект.ОстаткиПоСчетам.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ანგარიშები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Счета"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ОстаткиТоваровНаСкладе.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ნარჩენები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Остатки"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	РаспределитьПоКоличествуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ЭтоРаспределениеНаТовары = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары");
	
	//ПодольскиАИ #УчетПроектов 15.12.2020 {
	ЭтоРаспределениеПоПроектам = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам");
	Если ПрошлыйВидОперации <> Объект.ВидОперации Тогда
		
		Объект.ОстаткиПоСчетам.Очистить();
		Объект.ОстаткиТоваровНаСкладе.Очистить();
		
		ИнициализироватьКомпоновщикНастроек();
		
	КонецЕсли;
	ПрошлыйВидОперации = Объект.ВидОперации;
	//ПодольскиАИ #УчетПроектов 15.12.2020 }
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ВнеоборотныйАктивПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктивТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаТек,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииТек,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииТек,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииТек,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатратТек,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРеглТек,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельностиТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаНов,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииНов,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииНов,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииНов,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатратНов,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРеглНов,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельностиНов
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(
	|			&ДатаДокумента,
	|			Организация = &Организация
	|				И ВнеоборотныйАктив = &ВнеоборотныйАктив) КАК ПараметрыАмортизацииСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата - 1,ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", Объект.ВнеоборотныйАктив);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(объект,ВыборкаРезультат);
	КонецЦикла;
	
	Объект.СчетПереоценкиНов = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПрочиеДоходы");
	Объект.СтоимостьДляВычисленияАмортизацииНов = Объект.СтоимостьДляВычисленияАмортизацииНов + Объект.ОстаткиПоСчетам.Итог("Сумма");
	//Объект.СчетПереоценкиРеглНов =
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныйАктивПриИзменении(Элемент)
	
	ВнеоборотныйАктивПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СчетЗатратРеглНовПриИзмененииНаСервере()
	
	Объект.СчетЗатратНов = Объект.СчетЗатратРеглНов.СчетАналогУУ;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЗатратРеглНовПриИзменении(Элемент)
	
	СчетЗатратРеглНовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СчетПереоценкиРеглНовПриИзмененииНаСервере()
	
	Объект.СчетПереоценкиНов = Объект.СчетПереоценкиРеглНов.СчетАналогУУ;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПереоценкиРеглНовПриИзменении(Элемент)
	
	СчетПереоценкиРеглНовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуВА(Команда)
	Объект.СтоимостьДляВычисленияАмортизацииНов = Объект.СтоимостьДляВычисленияАмортизацииТек + Объект.ОстаткиПоСчетам.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоСчетамСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОстаткиПоСчетам.ТекущиеДанные;
	
	Если ТекущаяСтрока.Сумма > ТекущаяСтрока.СуммаКотроль Тогда 
		
		Сообщить(НСтр("ru = 'Сумма по счету не может привышать оборот "+ТекущаяСтрока.СуммаКотроль+"'; ka = 'დანახარჯის ანგარიშზე არარის საკმარისი ნაშთი "+ТекущаяСтрока.СуммаКотроль+"'"));
		ТекущаяСтрока.Сумма = ТекущаяСтрока.СуммаКотроль;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаРеглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивТиповСчетов = Новый Массив;
	МассивТиповСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСчетов.НезавершенноеПроизводство"));
	МассивТиповСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСчетов.КосвенныеЗатраты"));
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчетаУУ", МассивТиповСчетов);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.СчетаУчетаРегл.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.Дата); //+++ Дмгг
	
КонецПроцедуры
